---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BoundaryRestraintRotY
source: html/69a1f19c-cccd-3309-b80a-aa33cdfe9863.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BoundaryRestraintRotY Property

"Y Spring Modulus"

## Syntax (C#)
```csharp
public static ForgeTypeId BoundaryRestraintRotY { get; }
```